Revit 2027 API
BarTypeDiameterOptions.BarModelDiameter Property
 Represents the bar model diameter of the RebarBarType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double BarModelDiameter { get; set; }
Public Property BarModelDiameter As Double
	Get
	Set
public:
property double BarModelDiameter {
	double get ();
	void set (double value);
}
member BarModelDiameter : float with get, set
Property Value
Double
See Also
Reference
BarTypeDiameterOptions Class
Autodesk.Revit.DB Namespace